In [14]:
import numpy as np
import pandas as pd 

list_names = ['Amy White', 'Jack Stewart', 'Richard Lauderdale', 'Sara Johnson']
list_ages = [50, 53, 35, 43]
list_exp = [5, 8, 3, 10]
series_names = pd.Series(list_names)
series_ages = pd.Series(list_ages)
series_exp = pd.Series(list_exp)
data = {'Name': series_names,
        'Age': series_ages,
        'Working Experience (Yrs.)': series_exp}

df = pd.DataFrame(data)
print(df)

                 Name  Age  Working Experience (Yrs.)
0           Amy White   50                          5
1        Jack Stewart   53                          8
2  Richard Lauderdale   35                          3
3        Sara Johnson   43                         10

In [18]:
list_names = ['Amy White', 'Jack Stewart', 'Richard Lauderdale', 'Sara Johnson']
list_ages = [50, 53, 35, 43]
list_exp = [5, 8, 3, 10]

series_names = pd.Series(list_names)
series_ages = pd.Series(list_ages)
series_exp = pd.Series(list_exp)

data = [list_names, list_ages, list_exp]


df = pd.DataFrame(data)

print(df)

                                                   0
0  [Amy White, Jack Stewart, Richard Lauderdale, ...
1                                   [50, 53, 35, 43]
2                                      [5, 8, 3, 10]

In [23]:
import pandas as pd

data = {
    "Name":pd.Series(['Amy White', 'Jack Stewart', 'Richard Lauderdale', 'Sara Johnson']), 
    "Age":pd.Series([50, 53, 35, 43]), 
    "Working Experience (Yrs.)": pd.Series([5,8,3,10])}


df = pd.DataFrame(data)
df.index +=1
df

                 Name  Age  Working Experience (Yrs.)
1           Amy White   50                          5
2        Jack Stewart   53                          8
3  Richard Lauderdale   35                          3
4        Sara Johnson   43                         10

In [33]:
import pandas as pd
data = {
    "Name":['Amy White', 'Jack Stewart', 'Richard Lauderdale', 'Sara Johnson'], 
    "Age":[50, 53, 35, 43], 
    "Working Experience (Yrs.)":[5,8,3,10]}
    
df = pd.DataFrame(data, index=[1,2,3,4])
df

                 Name  Age  Working Experience (Yrs.)
1           Amy White   50                          5
2        Jack Stewart   53                          8
3  Richard Lauderdale   35                          3
4        Sara Johnson   43                         10